# Install via
# $ brew tap Homebrew/bundle
# $ brew bundle

# This puts the applications in the correct folder
cask_args appdir: '/Applications'

# List of brew repositories
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/versions'
tap 'homebrew/versions'

# Use GNU instead of BSD commands
# the with-default-names uses normal name, rather than
brew 'coreutils'
# brew 'binutils'
# brew 'diffutils'
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'screen'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget', args: ['with-iri']

# Update tools that already exist on Mac

# Newest version of Bash 4.x
brew 'bash'
# Bash tab completion for Bash 4.x
brew 'bash-completion2'
# Better top command
brew 'htop'

# Git and some surrounds
brew 'git'
brew 'git-lfs'
brew 'git-flow'
brew 'git-extras'
# brew 'hub'

# Amazon command line interface
brew 'awscli'

# Simple cheat-sheets; install and run $ cheat tar
brew 'cheat'

# brew 'ctags'
brew 'file-formula'
brew 'gcc'
brew 'gpatch'
brew 'gpg'
# brew 'jsonpp'
brew 'less'
brew 'make'
# brew 'most'
brew 'rsync'
# # Don't use non-native ssh if storing passphrase in Keychain
# brew 'openssh'
# brew 'ssh-copy-id'
brew 'imagemagick', args: ['with-webp']

brew 'pandoc'
brew 'rename'
# brew 'svn'
# brew 'the_silver_searcher'
# Using tmux
brew 'tmux'
# This apparently helps tmux work without problems.
brew 'reattach-to-user-namespace'

# Visualize directory structure
brew 'tree'

brew 'unrar'
brew 'unzip'
brew 'vim', args: ['override-system-vi']
brew 'emacs', args: ['--with-cocoa']

# Mac Swiss Army Knife https://github.com/rgcr/m-cli
brew 'm-cli'

# Install additional applications

cask 'google-cloud-sdk'
cask 'google-chrome'
# cask 'sublime-text'
cask 'sublime-text-dev'
cask 'aquamacs'
cask 'github-desktop'
cask 'dropbox'
cask 'arq'
cask 'keybase'
cask 'caffeine'
cask 'spectacle'
cask 'quicksilver'
cask 'yujitach-menumeters'
cask 'itsycal'
cask 'omnidisksweeper'
cask 'harvest'
cask 'toggldesktop'
cask 'selfcontrol'
cask 'transmission'
cask 'vlc'

# Install QuickLook plugins https://github.com/sindresorhus/quick-look-plugins

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# # Not installing these applications via brew cask

# cask 'slack'
# cask 'flux'
# cask 'sourcetree'
# cask 'spotify'
# cask 'spotify-notifications'
# cask 'iterm2'
# cask 'adobe-reader'

# # This installs helper functions.
# tap 'jbwhit/tap'
# brew 'nb3automation'
